read_verilog -sv -formal -overwrite {workspace}/DCS-Connection/Lab1/Comb_dcs076.sv
design -reset-vlog; proc;
write_json {workspace}/netlist/Comb.json