read_verilog -sv -formal -overwrite {workspace}/HDLBits-Practice/FSM/2013_q2afsm.sv
design -reset-vlog; proc;
write_json {workspace}/netlist/top_module.json